/* If a X.500 name has a description and a common name we display Common Name (Description) using this format string */
"%@ (%@)" = "%1$@ (%2$@)";

/* Format string used to build a list of values, first argument is list second argument is to be appended element */
"%@, %@" = "%1$@, %2$@";

/* Format string for encoded field data (e.g. Sequence; 128 bytes; data = 00 00 ...) */
"%@; %d %@; data = %@" = "%1$@; %2$d %3$@; data = %4$@";

/* format string to turn version number into a string */
"%d" = "%d";

/* Value of a field if its length is 0 */
"<NULL>" = "<NULL>";

/* CRL Distribution Points extension supported reason name */
"AA Compromise" = "AA Compromise";

/* Label of field in authority info access extension */
"Access Location" = "Access Location";

/* Label of field in authority info access extension */
"Access Method" = "Access Method";

/* CRL Distribution Points extension supported reason name */
"Affiliation Changed" = "Affiliation Changed";

/* Label of the algorithm subfield of an AlgorithmIdentifier */
"Algorithm" = "Algorithm";

/* Label of field in Authority Key Identifier extension */
"Authority Certificate Serial Number" = "Authority Certificate Serial Number";

/* Authority info access extension label */
"Authority Information Access" = "Authority Information Access";

/* Authority Key Identifier extension label */
"Authority Key Identifier" = "Authority Key Identifier";

/* Label used for Basic Constraints when value is invalid */
"Basic Constraints" = "Basic Constraints";

/* First argument to SEC_BLOB_KEY format string for a bit string */
"Bit string" = "Bit string";

/* No comment provided by engineer. */
"bits" = "bits";

/* First argument to SEC_BLOB_KEY format string for a Byte string */
"Byte string" = "Byte string";

/* Third argument to SEC_BLOB_KEY format string for a byte string */
"bytes" = "bytes";

/* CRL Distribution Points extension supported reason name */
"CA Compromise" = "CA Compromise";

/* X.509 key usage bit-field name */
"Cert Sign" = "Cert Sign";

/* Label for boolean is_ca property of a basic constraints extension */
"Certificate Authority" = "Certificate Authority";

/* CRL Distribution Points extension supported reason name */
"Certificate Hold" = "Certificate Hold";

/* Certificate Policies extension label */
"Certificate Policies" = "Certificate Policies";

/* CRL Distribution Points extension supported reason name */
"Cessation Of Operation" = "Cessation Of Operation";

/* Label of field in Certificate Policies extension */
"CPS URI" = "CPS URI";

/* Label of field in extension that indicates whether this extension is critical */
"Critical" = "Critical";

/* CRL Distribution Points extension label */
"CRL Distribution Points" = "CRL Distribution Points";

/* Label for CRL issuer field of CRL Distribution Points extension */
"CRL Issuer" = "CRL Issuer";

/* X.509 key usage bit-field name */
"CRL Sign" = "CRL Sign";

/* Label for raw data of extension (used for unknown extensions) */
"Data" = "Data";

/* X.509 key usage bit-field name */
"Data Encipherment" = "Data Encipherment";

/* X.509 key usage bit-field name */
"Decipher Only" = "Decipher Only";

/* X.509 key usage bit-field name */
"Digital Signature" = "Digital Signature";

/* label for general name field value */
"Directory Name" = "Directory Name";

/* Label present in qcStatements extension: URL where disclosures can be found */
"Disclosure Location" = "Disclosure Location";

/* label for general name field value */
"DNS Name" = "DNS Name";

/* label for general name field value */
"EDI Party Name" = "EDI Party Name";

/* Label present in qcStatements extension: can be used for an electronic seal */
"Electronic Seal" = "Electronic Seal";

/* Label present in qcStatements extension: can be used for a signature */
"Electronic Signature" = "Electronic Signature";

/* label for general name field value */
"Email Address" = "Email Address";

/* X.509 key usage bit-field name */
"Encipher Only" = "Encipher Only";

/* Label for general name of an excluded subtree in name constraints extension. */
"Excluded Subtree General Name" = "Excluded Subtree General Name";

/* Label for maximum base distance property of an excluded subtree in name constraints extension. */
"Excluded Subtree Maximum" = "Excluded Subtree Maximum";

/* Label for minimum base distance property of an excluded subtree in name constraints extension. */
"Excluded Subtree Minimum" = "Excluded Subtree Minimum";

/* No comment provided by engineer. */
"Expired" = "Expired";

/* Label of expiration date value when certificate is temporally valid */
"Expires" = "Expires";

/* Label of field in Certificate Policies extension */
"Explicit Text" = "Explicit Text";

/* Extended key usage extension label */
"Extended Key Usage" = "Extended Key Usage";

/* No comment provided by engineer. */
"Fingerprints" = "Fingerprints";

/* Label used for General Name entry when value is invalid */
"General Name" = "General Name";

/* Label used for General Names when value is invalid */
"General Names" = "General Names";

/* No comment provided by engineer. */
"Hostname mismatch." = "Hostname mismatch.";

/* Label of field in policy constraints extension */
"Inhibit Policy Mapping" = "Inhibit Policy Mapping";

/* Label of a value is printed into this string if the data is not valid */
"Invalid %@" = "Invalid %@";

/* No comment provided by engineer. */
"Invalid certificate chain linkage." = "Invalid certificate chain linkage.";

/* label for general name field value */
"IP Address" = "IP Address";

/* No comment provided by engineer. */
"Issued By" = "Issued By";

/* No comment provided by engineer. */
"Issuer Name" = "Issuer Name";

/* No comment provided by engineer. */
"Issuer Summary" = "Issuer Summary";

/* No comment provided by engineer. */
"Issuer Unique ID" = "Issuer Unique ID";

/* X.509 key usage bit-field name */
"Key Agreement" = "Key Agreement";

/* CRL Distribution Points extension supported reason name */
"Key Compromise" = "Key Compromise";

/* X.509 key usage bit-field name */
"Key Encipherment" = "Key Encipherment";

/* Label of field in Subject or Authority Key Identifier extension */
"Key Identifier" = "Key Identifier";

/* Label present in qcStatements extension: Limit Value specifies a maximum monetary value */
"Limit Value" = "Limit Value";

/* Label used for Name Constraints when value is invalid */
"Name Constraints" = "Name Constraints";

/* Subsection label in CRL Distribution Points extension. */
"Name Relative To CRL Issuer" = "Name Relative To CRL Issuer";

/* Value for a boolean property when its value is false (example critical: no) */
"No" = "No";

/* X.509 key usage bit-field name */
"Non-Repudiation" = "Non-Repudiation";

/* field value of parameters field when no parameters are present */
"none" = "none";

/* format string for undisplayed field data with a given DER tag and length */
"not displayed (tag = %ld; length %ld)" = "not displayed (tag = %1$ld; length %2$ld)";

/* label indicating the date after which something is no longer valid */
"Not Valid After" = "Not Valid After";

/* label indicating the soonest date at which something is valid */
"Not Valid Before" = "Not Valid Before";

/* Label of field in Certificate Policies extension */
"Notice Numbers" = "Notice Numbers";

/* Netscape certificate type usage value */
"Object Signing" = "Object Signing";

/* Netscape certificate type usage value */
"Object Signing CA" = "Object Signing CA";

/* value of an OID field if its length is more than what we allow for OIDs */
"OID too long" = "OID too long";

/* No comment provided by engineer. */
"One or more certificates have expired or are not valid yet." = "One or more certificates have expired or are not valid yet.";

/* No comment provided by engineer. */
"One or more certificates is using a weak key size." = "One or more certificates is using a weak key size.";

/* No comment provided by engineer. */
"One or more unsupported critical extensions found." = "One or more unsupported critical extensions found.";

/* Label of field in Certificate Policies extension */
"Organization" = "Organization";

/* Label used for Other Name RDN when value is invalid */
"Other Name" = "Other Name";

/* Label of the parameters subfield of an AlgorithmIdentifier */
"Parameters" = "Parameters";

/* Label for path length constraint property of a basic constraints extension */
"Path Length Constraint" = "Path Length Constraint";

/* Label for general name of a permitted subtree in name constraints extension. */
"Permitted Subtree General Name" = "Permitted Subtree General Name";

/* Label for maximum base distance property of a permitted subtree in name constraints extension. */
"Permitted Subtree Maximum" = "Permitted Subtree Maximum";

/* Label for minimum base distance property of a permitted subtree in name constraints extension. */
"Permitted Subtree Minimum" = "Permitted Subtree Minimum";

/* Policy constraints extension label */
"Policy Constraints" = "Policy Constraints";

/* Format string for label of field in Certificate Policies extension, %d is a monotonic increasing counter starting at 1 */
"Policy Identifier #%d" = "Policy Identifier #%d";

/* Format string for label of field in Certificate Policies extension, %d is a monotonic increasing counter starting at 1 */
"Policy Qualifier #%d" = "Policy Qualifier #%d";

/* No comment provided by engineer. */
"Policy requirements not met." = "Policy requirements not met.";

/* Label for an invalid private key usage period value */
"Private Key Usage Period" = "Private Key Usage Period";

/* CRL Distribution Points extension supported reason name */
"Privilege Withdrawn" = "Privilege Withdrawn";

/* No comment provided by engineer. */
"Public Key Algorithm" = "Public Key Algorithm";

/* No comment provided by engineer. */
"Public Key Data" = "Public Key Data";

/* No comment provided by engineer. */
"Public Key Info" = "Public Key Info";

/* No comment provided by engineer. */
"Public Key Size" = "Public Key Size";

/* Label of field in extended key usage extension */
"Purpose" = "Purpose";

/* Label of field in Certificate Policies extension */
"Qualifier" = "Qualifier";

/* Label of a RDN */
"RDN" = "RDN";

/* CRL Distribution Points extension supported reasons bit-field label */
"Reasons" = "Reasons";

/* label for general name field value */
"Registered ID" = "Registered ID";

/* Label of field in policy constraints extension */
"Require Explicit Policy" = "Require Explicit Policy";

/* Netscape certificate type usage value */
"Reserved" = "Reserved";

/* Label present in qcStatements extension: specifies how long to keep data */
"Retention Period" = "Retention Period";

/* No comment provided by engineer. */
"Root certificate is not trusted." = "Root certificate is not trusted.";

/* Netscape certificate type usage value */
"S/MIME" = "S/MIME";

/* Netscape certificate type usage value */
"S/MIME CA" = "S/MIME CA";

/* First argument to SEC_BLOB_KEY format string for a Sequence */
"Sequence" = "Sequence";

/* No comment provided by engineer. */
"Serial Number" = "Serial Number";

/* First argument to SEC_BLOB_KEY format string for a Set */
"Set" = "Set";

/* No comment provided by engineer. */
"SHA-1" = "SHA-1";

/* No comment provided by engineer. */
"SHA-256" = "SHA-256";

/* No comment provided by engineer. */
"Signature" = "Signature";

/* No comment provided by engineer. */
"Signature Algorithm" = "Signature Algorithm";

/* No comment provided by engineer. */
"Signature Data" = "Signature Data";

/* Netscape certificate type usage value */
"SSL CA" = "SSL CA";

/* Netscape certificate type usage value */
"SSL client" = "SSL client";

/* Netscape certificate type usage value */
"SSL server" = "SSL server";

/* Subject Key Identifier extension label */
"Subject Key Identifier" = "Subject Key Identifier";

/* No comment provided by engineer. */
"Subject Name" = "Subject Name";

/* No comment provided by engineer. */
"Subject Unique ID" = "Subject Unique ID";

/* CRL Distribution Points extension supported reason name */
"Superseded" = "Superseded";

/* No comment provided by engineer. */
"This certificate has an issuer that has expired" = "This certificate has an issuer that has expired";

/* No comment provided by engineer. */
"This certificate has an issuer that is not yet valid" = "This certificate has an issuer that is not yet valid";

/* No comment provided by engineer. */
"This certificate has expired" = "This certificate has expired";

/* No comment provided by engineer. */
"This certificate is not yet valid" = "This certificate is not yet valid";

/* The certificate is temporally valid */
"This certificate is valid" = "This certificate is valid";

/* No comment provided by engineer. */
"Unable to build chain to root certificate." = "Unable to build chain to root certificate.";

/* Label of a value is printed into this string if the data can not been parsed according to its type */
"Unparsed %@" = "Unparsed %@";

/* CRL Distribution Points extension supported reason name */
"Unused" = "Unused";

/* label for general name field value */
"URI" = "URI";

/* Label for KeyUsage bit-field values */
"Usage" = "Usage";

/* No comment provided by engineer. */
"Valid from" = "Valid from";

/* No comment provided by engineer. */
"Validity Period" = "Validity Period";

/* No comment provided by engineer. */
"Version" = "Version";

/* Label present in qcStatements extension: can be used for website authentication */
"Web Authentication" = "Web Authentication";

/* label for general name field value */
"X.400 Address" = "X.400 Address";

/* Label of a X.501 Name */
"X.501 Name" = "X.501 Name";

/* Value for a boolean property when it's value is true (example critical: yes) */
"Yes" = "Yes";

